Revit 2023 API
MassZone.SpaceType Property
 The gbXMLSpaceType of the MassZone.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2012
Syntax
C#
public gbXMLSpaceType SpaceType { get; set; }
Visual Basic
Public Property SpaceType As gbXMLSpaceType
	Get
	Set
Visual C++
public:
property gbXMLSpaceType SpaceType {
	gbXMLSpaceType get ();
	void set (gbXMLSpaceType value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The space type does not fall within an appropriate range.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
MassZone Class
Autodesk.Revit.DB.Analysis Namespace